#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

data.scaleway_iam_application.cert_manager: Reading...
data.scaleway_iam_application.kapsule: Reading...
data.scaleway_domain_zone.root: Reading...
scaleway_domain_zone.dev[0]: Refreshing state... [id=dev.dotstory.de]
scaleway_object_bucket.upload: Refreshing state... [id=fr-par/strategytool-upload]
module.k8s_cluster.scaleway_vpc_private_network.this: Refreshing state... [id=fr-par/dffb52b6-2a4c-4623-9044-8dc37c8949af]
module.rdb_databases["strategytool"].random_password.this: Refreshing state... [id=none]
module.k8s_deployments.random_password.auth_secret: Refreshing state... [id=none]
module.rdb_databases["keycloak"].random_password.this: Refreshing state... [id=none]
data.scaleway_iam_application.strategytool: Reading...
module.k8s_deployments.random_password.keycloak: Refreshing state... [id=none]
data.scaleway_domain_zone.root: Read complete after 1s [id=.dotstory.de]
data.scaleway_iam_application.strategytool: Read complete after 1s [id=fff61d3e-5eda-4feb-86fc-8e279f38f1b9]
scaleway_domain_record.mail: Refreshing state... [id=ac8ad8b3-58a1-46f0-ae96-db72b078f6e6]
scaleway_tem_domain.this: Refreshing state... [id=fr-par/0d097f01-517e-4717-aa53-059b5dd8130c]
data.scaleway_iam_application.cert_manager: Read complete after 1s [id=d6b54a86-4e7b-49ad-805f-a0d8ab2bb564]
scaleway_iam_api_key.cert_manager: Refreshing state... [id=SCW2M0XRCQKMHXR9VJMC]
scaleway_iam_api_key.strategytool: Refreshing state... [id=SCW5PS2PWRWZMZXE4N28]
data.scaleway_iam_application.kapsule: Read complete after 1s [id=48b5a810-07bc-40b0-b208-ceb70c9f96fc]
scaleway_iam_api_key.registry_password: Refreshing state... [id=SCWV1PBFXRG419GE6HQH]
scaleway_domain_record.dkim: Refreshing state... [id=d43ae056-f879-4601-b6e9-5c9a70d2961a]
scaleway_domain_record.spf: Refreshing state... [id=82244a99-9ad1-4acb-ac7f-ef1e3969f5cf]
data.keycloak_openid_client.strategytool: Reading...
data.keycloak_openid_client.strategytool: Read complete after 0s [id=899c22af-b2c6-4084-a1fe-26d2510386a2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # scaleway_tem_domain.this has been deleted
  - resource "scaleway_tem_domain" "this" {
      - dkim_config            = "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA36nbDl/QezByiW1qdJ59Q5Yc3286Bd4b2AmCXZVef28PwIkJa6M5jtZS4krAZC4cv2OJnKKVlPZbA6dDPzYDbwN30qKjo6txmrOTyAGmsgbfD+neiZf/FtAtNVaEgn7AsKtU6QjFBE8IDJj0G/eC37j7gIWXWAJKDEk67/Rdo6lL5ZnWQ3AsnXIO2r/h+hm4bAIx5TUY4QLsA3YcNe0LO+GBZdHE2R4uND6VgNvjQDmOIMLCZagKqMkIRHIkK7KEkgqJxrzj/5YpXFVRPPDeY5mF82QMGNPQpcES9HKqTYPT5FVTPM2QqkPHz/9RlBxAwsaxvG5dW+nIRzaN+n7+UQIDAQAB" -> null
        id                     = "fr-par/0d097f01-517e-4717-aa53-059b5dd8130c"
        name                   = "dotstory.de"
      - project_id             = "41b5c043-ce43-4431-a671-8ce6774d61ff" -> null
      - spf_config             = "include:_spf.scw-tem.cloud" -> null
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # scaleway_domain_record.dkim must be replaced
-/+ resource "scaleway_domain_record" "dkim" {
      ~ data            = "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA36nbDl/QezByiW1qdJ59Q5Yc3286Bd4b2AmCXZVef28PwIkJa6M5jtZS4krAZC4cv2OJnKKVlPZbA6dDPzYDbwN30qKjo6txmrOTyAGmsgbfD+neiZf/FtAtNVaEgn7AsKtU6QjFBE8IDJj0G/eC37j7gIWXWAJKDEk67/Rdo6lL5ZnWQ3AsnXIO2r/h+hm4bAIx5TUY4QLsA3YcNe0LO+GBZdHE2R4uND6VgNvjQDmOIMLCZagKqMkIRHIkK7KEkgqJxrzj/5YpXFVRPPDeY5mF82QMGNPQpcES9HKqTYPT5FVTPM2QqkPHz/9RlBxAwsaxvG5dW+nIRzaN+n7+UQIDAQAB" -> (known after apply)
      ~ id              = "d43ae056-f879-4601-b6e9-5c9a70d2961a" -> (known after apply)
      + keep_empty_zone = false
      ~ name            = "41b5c043-ce43-4431-a671-8ce6774d61ff._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ priority        = 0 -> (known after apply)
      ~ project_id      = "41b5c043-ce43-4431-a671-8ce6774d61ff" -> (known after apply)
      ~ root_zone       = true -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # scaleway_domain_record.spf will be updated in-place
  ~ resource "scaleway_domain_record" "spf" {
      ~ data            = "v=spf1 include:_spf.scw-tem.cloud -all" -> (known after apply)
        id              = "82244a99-9ad1-4acb-ac7f-ef1e3969f5cf"
      + keep_empty_zone = false
        # (6 unchanged attributes hidden)
    }

  # scaleway_tem_domain.this will be created
  + resource "scaleway_tem_domain" "this" {
      + accept_tos             = true
      + created_at             = (known after apply)
      + dkim_config            = (known after apply)
      + id                     = (known after apply)
      + last_error             = (known after apply)
      + last_valid_at          = (known after apply)
      + name                   = "dotstory.de"
      + next_check_at          = (known after apply)
      + project_id             = (known after apply)
      + region                 = (known after apply)
      + revoked_at             = (known after apply)
      + smtp_host              = (known after apply)
      + smtp_port              = (known after apply)
      + smtp_port_alternative  = (known after apply)
      + smtp_port_unsecure     = (known after apply)
      + smtps_port             = (known after apply)
      + smtps_port_alternative = (known after apply)
      + spf_config             = (known after apply)
      + status                 = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @freudenberg, Action: `pull_request`*